[
    {
        "id": 1,
        "year": "2013",
        "title": "Gift Wrapper",
        "company": "Takashimaya Singapore Ltd.",
        "period": "November - December 2013, 2014, 2017, 2020",
        "description": [
           "<b>Customer Service</b>: Fulfilled customer packaging service requests.",
            "<b>Operational Support</b>: Demonstrated attention to detail and teamwork by assisting with work area setup, wrap-up, and stock taking."
        ],
        "printable": false,
        "displayMode": [1]
    },
    {
        "id": 2,
        "year": "2015",
        "title": "Gift Wrapper Leader",
        "company": "Takashimaya Singapore Ltd.",
        "period": "November - December 2015, 2019",
        "description": [
            "<b>Operations Oversight</b>: Oversaw daily operations, including staffing, scheduling, and resource allocation.",
            "<b>Conflict Resolution</b>: Facilitated resolution of unforeseen events and customer-personnel conflicts.",
            "<b>Customer Fulfillment</b>: Fulfilled customer packaging service requests efficiently."
        ],
        "printable": false,
        "displayMode": [1]
    },
    {
        "id": 3,
        "year": "2017",
        "title": "IT Intern",
        "company": "Shaw Organisation Pte Ltd.",
        "period": "October 2016 - February 2017",
        "description": [
            {
                "department": "I.C.E Department",
                "period": "October 2016 - February 2017",
                "scope": [
                    "<b>Project Contribution</b>: Contributed to the development and testing of a new movie ticketing system. Improved code performance and readability through refactoring.",
                    "<b>Chatbot Development</b>: Collaborated with team to develop a mobile chatbot using Azure LUIS and Java for movie inquiries and ticket reservations."
                ],
                "resumeScope": [
                    "Tested and refactored code of a new movie ticketing system, for performance optimization.", "Collaborated on developing a mobile chatbot using Azure Luis and Java for movie inquiries and ticket reservations, enhancing user experience and streamlining the reservation process."
                ],
                "awards": [
                    ""
                ]
            }
        ],
        "printable": true,
        "displayMode": [0, 1]
    },
    {
        "id": 4,
        "year": "2018",
        "title": "Event Game Marshal (Robocar Poli Toy Carnival)",
        "company": "Pro & Pacific Pte Ltd.",
        "period": "June 2018",
        "description": [
            "<b>Customer Service</b>: Delivered exceptional customer service by promptly addressing requests and inquiries during the event.",
            "<b>Event Management</b>: Managed multiple game booths, ensuring customer engagement and satisfaction.",
            "<b>Operational Support</b>: Contributed to the event's overall success by handling housekeeping duties and efficient event setup/teardown.",
            "<b>Teamwork</b>: Demonstrated strong teamwork and attention to detail throughout the event."
        ],
        "printable": false,
        "displayMode": [1]
    },
    {
        "id": 5,
        "year": "2018",
        "title": "Promoter",
        "company": "Pro & Pacific Pte Ltd.",
        "period": "July - August 2018",
        "description": [
            "<b>Sales</b>: Actively promoted and successfully sold toys to customers in a retail environment.",
            "<b>Customer Service</b>: Provided excellent customer service by addressing customer inquiries and resolving issues effectively."
        ],
        "printable": false,
        "displayMode": [1]
    },
    {
        "id": 6,
        "year": "2019",
        "title": "IT Intern",
        "company": "Lucky Joint Construction Pte Ltd.",
        "period": "July - August 2019",
        "description": [
            {
                "department": "",
                "period": "July - August 2019",
                "scope": [
                    "<b>Web Development</b>: Developed and enabled an efficient <i>asset tracking and management system</i> for multiple users, using ASP.NET web application, C#, and Microsoft SQL Server."
                     ],
                "resumeScope": [
                    "Developed & deployed an IT asset management system with multi-user access (ASP.NET, C#, SQL Server), streamlining asset tracking & management."
                ],
                "awards": []
            }
        ],
        "printable": true,
        "displayMode": [0, 1]
    },
    {
        "id": 7,
        "year": "2021",
        "title": "Associate Solution Engineer",
        "company": "Oracle CAPAC Services Unlimited Company (Singapore Branch)",
        "period": "September 2021 - June 2024",
        "description": [
            {
                "department": "Solution Engineering Graduate Program",
                "period": "September 2021 - May 2022",
                "scope": [
                    "<b>Technical Proficiency</b>: Acquired in-depth knowledge of Oracle cloud products. Developed essential soft skills for sales role.",
                    "<b>Data Ingestion Prototype</b>: Built a Python-based prototype to seamlessly integrate user-provided APIs with Oracle Autonomous Data Warehouse. Leveraged Linux environment for development."

                   ],
                "awards": [
                    "FY22 Graduate Program - \"GRADhacks\" Hackathon - Best Engagement (January 2022)"
                ]
            },
            {
                "department": "Innovation Center, Center of Excellence",
                "period": "June 2022 - May 2024",
                "scope": [
                    "<b>Quality Assurance</b>: Conducted end-to-end testing for <i>Oracle Cloud native asset management and deployment platform</i>. Utilized Apache JMeter and Selenium WebDriver for test automation.",
                    "<b>Web Development</b>: Designed and developed user-friendly web interfaces for <i>Oracle Cloud native data integration and knowledge management platforms</i>. Employed Apache HTTP Server, PHP, HTML, CSS, and JavaScript for development.",
                    "<b>Project Involvement</b>: Contributed to a suite of innovative accelerators."
                  ],
                "resumeScope": [
                    "<b>QA Tester</b>: Conducted end-to-end testing for Oracle Cloud asset management using JMeter and Selenium WebDriver.",
                    "<b>Web Developer</b>: Designed and developed user-friendly interfaces for Oracle Cloud-native platforms, leveraging Apache HTTP Server, PHP, HTML/CSS, and JavaScript.",
                    "<li>Created a productivity platform with knowledge analytics and low-code data democratization framework.</li>"
                ],
                "awards": [
                    "FY24 Q1 Exceptional Contributor of the Quarter (September 2023)"
                ]
            }
        ],
        "printable": true,
        "displayMode": [0, 1]
    },
    {
        "id": 8,
        "year": "2024",
        "title": "Cloud Engineer",
        "company": "Oracle CAPAC Services Unlimited Company (Singapore Branch)",
        "period": "June 2024 - Present",
        "description": [
            {
                "department": "Innovation Center, Center of Excellence",
                "period": "June 2024 - Present",
                "scope": [
                    "<b>UI/UX Architect</b>: Designed and developed user-friendly interfaces for Oracle Cloud-native platforms, leveraging Apache HTTP Server, PHP, HTML/CSS, and JavaScript",
                    "<b>Productivity Platform</b>:  Created a productivity platform with knowledge analytics, low-code data democratization framework, configurator and orchestrator. "
                  ],
                "resumeScope": [
                    "<b>UI/UX Architect</b>: Designed and developed user-friendly interfaces for Oracle Cloud-native platforms, leveraging Apache HTTP Server, PHP, HTML/CSS, and JavaScript.", "<li>Created a productivity platform with knowledge analytics, low-code data democratization framework, configurator and orchestrator.</li>"
                ],
                "awards": [
                    ""
                ]
            }
        ],
        "printable": true,
        "displayMode": [0, 1]
    }
]